app/controllers/places_controller.rb

	def show
		@place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 50 LIMIT 1

	def delete
		@place = Place.find(params[:id])
	    @place.destroy
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 50 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 'id'

	def create
		@place = Place.create(:title => params[:title], :admission_price => params[:price], :description => params[:description], :photo_url => params[:photo_url])
---
INSERT INTO "places" ("admission_price", "description", "photo_url") VALUES (?, ?, ?)  [["admission_price", 1000], ["description", "fun place for the kids"], ["photo_url", "https://upload.wikimedia.org/wikipedia/commons/8/89/Field_Museum_of_Natural_History.jpg"]]

	def edit
		@place = Place.find(params[:id])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = ? LIMIT 1  [["id", 67]]

	def update
	  @place = Place.find(params[:id])
	  @place.update_attributes(:title => params[:title], :admission_price => params[:price], :description => params[:description], :photo_url => params[:photo_url])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1
UPDATE "places" SET "admission_price" = ?, "description" = ?, "photo_url" = ?, "title" = ? WHERE "places"."id" = 81  [["admission_price", 10000], ["description", "A fun place for the kids!"], ["photo_url", "http://jon-atkinson.com/Large%20Images%201/Grey%20Wolf%203.jpg"], ["title", "Field"]]